from settings import *
from meshes.base_mesh import BaseMesh


class Block(BaseMesh):
    def __init__(self, app):
        super().__init__()

        self.app = app
        self.ctx = self.app.ctx
        self.program = app.shader_program.block

        self.vbo_format = '3f 3f'
        self.attrs = ('in_position', 'in_color')
        self.vao = self.get_vao()

    def get_vertex_data(self):
        vertices = [
            # Вершины для стороны 1 (передняя)
            (15, 15, 15), (-15, 15, 15), (-15, -15, 15),
            (15, 15, 15), (-15, -15, 15), (15, -15, 15),

            # Вершины для стороны 2 (задняя)
            (15, 15, -15), (15, -15, -15), (-15, -15, -15),
            (15, 15, -15), (-15, -15, -15), (-15, 15, -15),

            # Вершины для стороны 3 (верхняя)
            (15, 15, 15), (15, 15, -15), (-15, 15, -15),
            (15, 15, 15), (-15, 15, -15), (-15, 15, 15),

            # Вершины для стороны 4 (нижняя)
            (15, -15, 15), (-15, -15, 15), (-15, -15, -15),
            (15, -15, 15), (-15, -15, -15), (15, -15, -15),

            # Вершины для стороны 5 (левая)
            (-15, 15, 15), (-15, 15, -15), (-15, -15, -15),
            (-15, 15, 15), (-15, -15, -15), (-15, -15, 15),

            # Вершины для стороны 6 (правая)
            (15, 15, 15), (15, -15, 15), (15, -15, -15),
            (15, 15, 15), (15, -15, -15), (15, 15, -15)
        ]
        colors = [
            (0, 1, 0), (1, 0, 0), (1, 1, 0),
            (0, 1, 0), (1, 1, 0), (0, 0, 1),

            (0, 1, 0), (1, 0, 0), (1, 1, 0),
            (0, 1, 0), (1, 1, 0), (0, 0, 1),

            (0, 1, 0), (1, 0, 0), (1, 1, 0),
            (0, 1, 0), (1, 1, 0), (0, 0, 1),

            (0, 1, 0), (1, 0, 0), (1, 1, 0),
            (0, 1, 0), (1, 1, 0), (0, 0, 1),

            (0, 1, 0), (1, 0, 0), (1, 1, 0),
            (0, 1, 0), (1, 1, 0), (0, 0, 1),

            (0, 1, 0), (1, 0, 0), (1, 1, 0),
            (0, 1, 0), (1, 1, 0), (0, 0, 1)
        ]

        vertex_data = np.hstack([vertices, colors], dtype='float32')
        return vertex_data
